Core/src/DataProcessors/ОбменСGoogle/ОбменСGoogle.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ОбменСGoogle</name>
</mdclass:DataProcessor>

Core/src/InformationRegisters/СеансовыеДанныеGoogle/СеансовыеДанныеGoogle.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СеансовыеДанныеGoogle</name>
  <resources>
    <name>access_token</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>token_type</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>refresh_token</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>disabled</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбластьДоступа</name>
    <type>
      <types>EnumRef.ОбластиДоступаGoogle</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УчетнаяЗаписьЭлектроннойПочты</name>
    <type>
      <types>CatalogRef.УчетныеЗаписиЭлектроннойПочты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/Enums/ОбластиДоступаGoogle/ОбластиДоступаGoogle.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ОбластиДоступаGoogle</name>
  <enumValues>
    <name>Профиль</name>
  </enumValues>
  <enumValues>
    <name>Календарь</name>
  </enumValues>
  <enumValues>
    <name>Почта</name>
  </enumValues>
  <enumValues>
    <name>Контакты</name>
  </enumValues>
</mdclass:Enum>

Core/src/DataProcessors/ОбменСGoogle/Forms/ВыполнитьОбменСGoogle/Module.bsl
&НаКлиенте
Перем ПараметрыОбработчикаОжидания;

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ОбластьДоступа", ОбластьДоступа);
	
	Элементы.ДекорацияВыполняетсяОбменGoogle.Заголовок = ЗаголовокВыполняетсяОбменGoogle();
	
	ОбменСGoogle.ИнициализироватьСеансовыеДанные(
	СеансовыеДанные,
	Пользователи.ТекущийПользователь(),
	ОбластьДоступа);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ОбменСGoogleКлиентСервер.НеЗаполненТокенДоступа(СеансовыеДанные) Тогда
		ПодключитьОбработчикОжидания("НачатьАвторизацию", 0.1, Истина);
	Иначе
		СинхронизироватьНаКлиенте();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура НачатьАвторизацию()
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьРезультатЗапросаТокена", ЭтотОбъект);
	ОткрытьФорму(
	"РегистрСведений.СеансовыеДанныеGoogle.Форма.ЗапросТокена",
	ОписаниеОбластейДоступа(),
	ЭтаФорма,,,,
	ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьРезультатЗапросаТокена(Результат, Параметры) Экспорт
	
	СеансовыеДанные = Результат;
	
	Если ОбменСGoogleКлиентСервер.НеЗаполненТокенДоступа(СеансовыеДанные) Тогда
		Закрыть();
		Возврат;
	КонецЕсли;
	
	СинхронизироватьНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура СинхронизироватьНаКлиенте()
	
	ДлительныеОперацииКлиент.ИнициализироватьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжидания);
	ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗадания", 1, Истина);
	
	СинхронизироватьНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура СинхронизироватьНаСервере()
	
	Если ОбластьДоступа = Перечисления.ОбластиДоступаGoogle.Календарь Тогда
		ОбменСGoogle.ИнициализироватьУзелПланаОбменаДляКалендаряGoogle();
	КонецЕсли;
	ОбменСGoogle.ИнициализироватьСеансовыеДанные(
	СеансовыеДанные,
	Пользователи.ТекущийПользователь(),
	ОбластьДоступа);
	
	Если ОбменСGoogleКлиентСервер.НеЗаполненТокенДоступа(СеансовыеДанные) Тогда
		Возврат;
	КонецЕсли;
	
	Результат = УправлениеНебольшойФирмойСервер.ЗапуститьВыполнениеВФоне(
	УникальныйИдентификатор,
	ИмяЗаданияНаСинхронизацию(),
	СеансовыеДанные,,
	Ложь);
	
	ИдентификаторЗадания = Результат.ИдентификаторЗадания;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПроверитьВыполнениеЗадания()
	
	Если ЗаданиеВыполнено(ИдентификаторЗадания) Тогда
		Закрыть();
		Возврат;
	КонецЕсли;
	
	ДлительныеОперацииКлиент.ОбновитьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжидания);
	ПодключитьОбработчикОжидания(
	"Подключаемый_ПроверитьВыполнениеЗадания",
	ПараметрыОбработчикаОжидания.ТекущийИнтервал,
	Истина);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗаданиеВыполнено(ИдентификаторЗадания)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Возврат ДлительныеОперации.ЗаданиеВыполнено(ИдентификаторЗадания);
	
КонецФункции

&НаСервере
Функция ЗаголовокВыполняетсяОбменGoogle()
	
	Если ОбластьДоступа = Перечисления.ОбластиДоступаGoogle.Контакты Тогда
		Возврат НСтр("ka='Выполняется загрузка контактов из Google...';ru='Выполняется загрузка контактов из Google...'");
	ИначеЕсли ОбластьДоступа = Перечисления.ОбластиДоступаGoogle.Календарь Тогда
		Возврат НСтр("ka='Выполняется синхронизация календаря с Google...';ru='Выполняется синхронизация календаря с Google...'");
	КонецЕсли;
	
	ВызватьИсключение НСтр("ka='Не указана область доступа для синхронизации с Google';ru='Не указана область доступа для синхронизации с Google'");
	
КонецФункции

&НаСервере
Функция ИмяЗаданияНаСинхронизацию()
	
	Если ОбластьДоступа = Перечисления.ОбластиДоступаGoogle.Контакты Тогда
		Возврат "ОбменСGoogle.ЗагрузитьКонтактыИзGoogle";
	ИначеЕсли ОбластьДоступа = Перечисления.ОбластиДоступаGoogle.Календарь Тогда
		Возврат "ОбменСGoogle.СинхронизироватьGoogleCalendar";
	КонецЕсли;
	
	ВызватьИсключение НСтр("ka='Не указана область доступа для синхронизации с Google';ru='Не указана область доступа для синхронизации с Google'");
	
КонецФункции

&НаКлиенте
Функция ОписаниеОбластейДоступа()
	
	Результат = Новый Структура("ОписанияОбластейДоступа");
	
	Если ОбластьДоступа = ПредопределенноеЗначение("Перечисление.ОбластиДоступаGoogle.Контакты") Тогда
		Результат.ОписанияОбластейДоступа = ОбменСGoogleКлиентСервер.ОписанияОбластейДоступаКонтакты();
	ИначеЕсли ОбластьДоступа = ПредопределенноеЗначение("Перечисление.ОбластиДоступаGoogle.Календарь") Тогда
		Результат.ОписанияОбластейДоступа = ОбменСGoogleКлиентСервер.ОписанияОбластейДоступаКалендарь();
	Иначе
		ВызватьИсключение НСтр("ka='Не указана область доступа для синхронизации с Google';ru='Не указана область доступа для синхронизации с Google'");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
